// 1) Напишіть (СЛОВАМИ НЕ КОДОМ) три прикладів з повсякденного життя, які можна вважати аналогами функцій з параметрами в програмуванні.
// Для кожного прикладу вкажіть, які є 'параметри', які 'аргументи' та який 'результат' повертається.

// 1.1)
// Функція: приготувати страву.
// Параметри: вид страви, кількість порцій.
// Аргументи: борщ, 4 порції.
// Результат: готовий борщ на 4 порції.

//  1.2)
// Функція: випрати одяг.
// Параметри: температура прання, режим прання, тривалість циклу.
// Аргументи: 40°C, делікатний режим, 60 хвилин.
// Результат: чистий випраний одяг.

//  1.3)
// Функція: замовити піцу.
// Параметри: вид піци, розмір, адреса доставки.
// Аргументи: пепероні, велика, вул. Юрьєва 31.
// Результат: велика піца «Пепероні», доставлена за вказаною адресою.

// 2) Напишіть (СЛОВАМИ НЕ КОДОМ) три приклади з повсякденного життя, які можна вважати аналогами функцій без параметрів в програмуванні.
// Для кожного прикладу вкажіть, який 'результат' відбувається автоматично, не вимагаючи від вас додаткових дій або передавання аргументів.

// 2.1)
// Функція: будильник.
// Результат: телефон автоматично подає звуковий сигнал у встановлений час.

// 2.2)
// Функція: сніданок.
// Результат: людина приймає сніданок і стає ситою та отримує енергію на початок дня.

// 2.3)
// Функція: сон.
// Результат: Людина спить, організм відпочиває, відновлює сили.