// ## 1. Обробка "брудних" даних
// Уявіть, що ціна товару приходить з бази як рядок із зайвими пробілами та технічними символами(оголосіть та ініціалізуйте змінну):
// `const databasePrice = "  1250.85_UAH  "`.

// **Ваше завдання:**
// - Отримайте з цього рядка чисте число (дробове).
// - Збільште отриману суму на 24% (податок).
// - Виведіть результат у консоль, залишивши лише **один знак** після коми.
// - **Додатково:** переконайтеся, що після округлення результат у консолі є саме числом, а не рядком.

const databasePrice = "  1250.85_UAH  "

// але тут можно ще було додати trim() для видалення пробілів, але parseFloat і так їх ігнорує, тому це не обов'язково
export const cleanPrice = parseFloat(databasePrice)

// є два способи збільшити суму на 24%: 

// коротнкий - помножити на 1.24 
export const increasedPriceShort = cleanPrice * 1.24

// довгий - спочатку вирахувати 24% від сумми і додати до суми.
const interestRate = 24
const interestAmount = cleanPrice * interestRate / 100
const increasedPriceLong = cleanPrice + interestAmount

// лишаємо результат з одним знаком після коми і перетворюємо його на число, щоб не було рядком
export const result = +increasedPriceShort.toFixed(1) 