// ## 2. Математика округлення
// Клієнт купує товар за ціною `499.99`. Адміністрація магазину вирішила, що в чеку не повинно бути копійок.

// **Ваше завдання:**
// - Оголосіть змінну з ціною товару.
// - Створіть два варіанти відображення цієї ціни:
//     1. Завжди округлена до цілого числа **в меншу сторону** (ціна для акції).
//     2. Завжди округлена до цілого числа **в більшу сторону** (ціна для прибутку).
// - Виведіть обидва результати в консоль.

const price = '499.99'

// округлення в меншу сторону
export const priceRoundedDown = Math.floor(parseFloat(price))

// округлення в більшу сторону
export const priceRoundedUp = Math.ceil(parseFloat(price))