// ## 5. Робота зі станами даних
// Дослідіть, як JavaScript поводиться з "порожніми" або непереданими даними.

// **Ваше завдання:**
// - Створіть функцію, яка приймає один аргумент (ім'я клієнта) і просто виводить його в консоль із підписом `"Статус клієнта:"`.
// - Викличте цю функцію тричі, передаючи різні типи даних:
//     1. Будь-яке реальне ім'я у лапках.
//     2. Спеціальне значення, що вказує на навмисну відсутність даних.
//     3. Викличте функцію, взагалі не передаючи їй нічого в дужках.
// - Зверніть увагу на різницю в консолі.

export function logClientStatus(clientName) {
    return "Статус клієнта: " + clientName
}