// 1)
// - Оголосіть три змінні: `stockQuantity` (скільки одиниць є на складі), `orderQuantity` (скільки хоче купити клієнт) та `isAvailable` (булеве значення, чи товар взагалі виставлений на продаж).
// - Напишіть логіку:
//     1. Якщо товар не виставлений на продаж (`isAvailable` є `false`), виведіть у консоль: `"Вибачте, цей товар зараз недоступний"`.
//     2. Якщо товар доступний, але `orderQuantity` більше ніж `stockQuantity`, виведіть у консоль: `"На складі недостатньо товарів. Доступно лише [кількість] шт."`.
//     3. В іншому випадку (якщо все добре), виведіть у консоль: `"Замовлення прийнято! Готуємо до відправки"`.

console.log("=== Система перевірки наявності (if/else) ===")

const stockQuantity = 10
const orderQuantity = 5
const isAvailable = true

if (isAvailable) {
    if (orderQuantity > stockQuantity) {
        console.log(`На складі недостатньо товарів. Доступно лише ${stockQuantity} шт.`)
    } else {
        console.log("Замовлення прийнято! Готуємо до відправки")
    }
} else {
    console.log("Вибачте, цей товар зараз недоступний")
}

//можнва зробити ще за допомогою тернарного оператора

// const message = isAvailable
//     ? orderQuantity > stockQuantity
//         ? `"На складі недостатньо товарів. Доступно лише ${stockQuantity} шт."`
//         : '"Замовлення прийнято! Готуємо до відправки"'
//     : '"Вибачте, цей товар сейчас недоступний"'

// console.log(message)

console.log("")

// 2)
// - Оголосіть змінну `totalPurchaseSum`.
// - Напишіть ланцюжок `if / else if / else`:
//     - Якщо сума від 1000 до 3000 грн (включно) — знижка 5%.
//     - Якщо сума понад 3000 до 5000 грн (включно) — знижка 10%.
//     - Якщо сума понад 5000 грн — знижка 15%.
//     - Якщо менше 1000 грн — знижки немає.
// - Виведіть у консоль повідомлення форматі: `"Ваша сума: [сума], знижка: [відсоток]%, до сплати: [сума з урахуванням знижки]"`.

console.log("=== Калькулятор багаторівневої знижки (Логічні оператори) ===")

// const userAmount = +prompt("Введіть суму яку ви хочете витратити:")
const userAmount = 4500
let discount = null
let totalPurchaseSum

if (!userAmount) {
    console.log("Введіть коректну суму")
}
else {
    if (userAmount > 0 && userAmount <= 1000) {
        discount = 0
        totalPurchaseSum = userAmount;
    } else if (userAmount <= 3000) {
        discount = 5
        totalPurchaseSum = userAmount - (userAmount * (discount / 100))
    } else if (userAmount <= 5000) {
        discount = 10
        totalPurchaseSum = userAmount - (userAmount * (discount / 100))
    } else {
        discount = 15
        totalPurchaseSum = userAmount - (userAmount * (discount / 100))
    }
    console.log(`Ваша сума: ${userAmount}, знижка: ${discount}%, до сплати: ${totalPurchaseSum}`)
}

console.log("")

// 3)
// - Створіть змінну `deliveryOption` (можливі значення: `"самовивіз"`, `"кур'єр"`, `"пошта"`).
// - Використовуючи конструкцію `switch`, виведіть повідомлення для кожного варіанту:
//     - `"самовивіз"` -> `"Ви можете забрати товар за адресою: вул. Центральна, 1 завтра з 10:00"`.
//     - `"кур'єр"` -> `"Доставка забере 24 години. Оплачується згідно з тарифами міста"`.
//     - `"пошта"` -> `"Ваше замовлення буде відправлено протягом дня. Очікуйте на SMS з номером ТТН"`.
//     - Якщо значення інше (default) -> `"Будь ласка, оберіть коректний спосіб доставки"`.

console.log("=== Вибір методу доставки (switch/case) ===")

const deliveryOption = "самовивіз" && "кур'єр" || "пошта" || null

switch (deliveryOption) {
    case "самовивіз":
        console.log("Ви можете забрати товар за адресою: вул. Центральна, 1 завтра з 10:00")
        break;

    case "кур'єр":
        console.log("Доставка забере 24 години. Оплачується згідно з тарифами міста")
        break;

    case "пошта":
        console.log("Ваше замовлення буде відправлено протягом дня. Очікуйте на SMS з номером ТТН")
        break;

    default:
        console.log("Будь ласка, оберіть коректний спосіб доставки")
        break;
}

console.log("")

// 4)
// - Оголосіть змінну `daysItemsLeft = 10` (кількість днів, протягом яких товар ще можна продавати).
// - Використовуючи цикл `while`, виводьте в консоль: `"Товар придатний ще [кількість] днів. Продаємо..."`.
// - На кожній ітерації зменшуйте кількість днів на 1.
// - Коли дні закінчаться (цикл завершиться), виведіть фінальне повідомлення: `"Стоп! Термін придатності вичерпано. Знімаємо з продажу"`.

console.log("=== Контроль термінів придатності (цикл while) ===")

let daysItemsLeft = 10

while (daysItemsLeft) {
    console.log(`Товар придатний ще ${daysItemsLeft} днів. Продаємо...`)
    daysItemsLeft--
}

console.log("Стоп! Термін придатності вичерпано. Знімаємо з продажу")

// 5)
// - Оголосіть змінну з правильним паролем: `const correctPassword = "admin123"`.
// - Оголосіть змінну `userGuess` без початкового значення.
// - Використовуйте цикл `do...while`:
//     - Всередині циклу через `prompt()` запитуйте у користувача пароль і зберігайте його у `userGuess`.
//     - Умова циклу: продовжувати, доки введене значення (`userGuess`) не збігається з `correctPassword`.
// - Після виходу з циклу виведіть у консоль (або через `alert`): `"Ласкаво просимо в особистий кабінет!"`.

const correctPassword = "admin123"
let userGuess

do {
    userGuess = prompt("Введіть пароль для входу в особистий кабінет:")
    if (!userGuess || userGuess !== correctPassword) {
        alert("Невірний пароль. Спробуйте ще раз.")
    } else {
        alert("Ласкаво просимо в особистий кабінет!")
    }
} while (userGuess !== correctPassword)